
# Задание 1.
# Стратегия – это поведенческий паттерн проектирования, который
# определяет семейство схожих алгоритмов и помещает каждый из них в
# собственный класс, после чего алгоритмы можно взаимозаменять прямо во
# время исполнения программы.
# Вы решили написать приложение-навигатор для путешественников.
# Оно должно показывать красивую и удобную карту, позволяющую с лёгкостью
# ориентироваться в незнакомом городе.
# Одной из самых востребованных функций являлся поиск и
# прокладывание маршрутов. Пребывая в неизвестном ему городе, пользователь
# должен иметь возможность указать начальную точку и пункт назначения, а
# навигатор – проложит оптимальный путь.
# В этом примере каждый алгоритм поиска пути переедет в свой
# собственный класс. В этих классах будет определён лишь один метод,
# принимающий в параметрах координаты начала и конца пути, а
# возвращающий массив точек маршрута. Реализуйте класс навигатора,
# который по переданной ему стратегии выполняет построение маршрута.
def execute_application():
    pass


if __name__ == "__main__":
    execute_application()